import React, { Fragment, useState } from 'react';
import CreatePostForm from '../components/CreatePostForm'
// import PostList from '../components/PostList'
import FilterBox from '../components/FilterBox'

const initialPosts = [
    {
      id: 1,
      title: 'Post1',
      content: 'แอบมองบนฟ้าได้เองกับเธอเสมอมา ก็คงต้องยอมทำได้เพื่อเธอจะไม่ยอมให้ วันที่มันอีกครั้งจังจังโดนแน่นนอน เราจะไปถึงเวลาที่เราพร้อมร่วมทางไม่ช้า ทำตามฝันสักวันไม่รักที่มันสั่นอิสระตาร์ตฟันนราธิวาสบายก่อนจะผิดหวังกี่ครั้ง ไปโรงเรียนอีกแล้ววันที่ดีดีถ้าหัวใจบอกมาจากฟ้าที่เราจะไม่ว่าใครๆ ก็ไม่รู้ว่าเขานั้นในใจแอบคิดอะไร และเมื่อไรที่ฉันได้ไปเลยไม่ยอมแพ้ ต้องซื่อสัตย์เท่านั้นแม้พรุ่งนี้ไม่มีหนทางที่มีแค่เดินไป',
      author: 'User1',
      image: '/max.jpg',
    },
    {
      id: 2,
      title: 'Post2',
      content: 'ให้ฉันในวันที่ผ่านเข้ามาจากเจ้านั้น เหมือนแสงอาทิตย์สว่างในใจของฉันยังคงจะมีอยู่ใกล้ๆไม่สู้ลาลา บอกให้ฉันได้รับรู้ดีเกินพอและไม่ทำให้หัวใจรู้ว่าเธอ ให้มันหลุดลอยดังมนต์สะกดให้ฉันมีน้ำตา ความรักไปซะทีส่องกระจกอีกสักเท่าไร จะต้องไปอย่าไปคิดอะไรที่อยู่บนฟ้าได้โปรดช่วยหยุดเวลาที่เราพร้อมก้าวเดินต่อ และเธอจะรอทำไมไม่ช่วยสักนิด หมุนไปเจอกันสักทีไม่เคยจะไม่มองตา',
      author: 'User2',
    },
    {
      id: 3,
      title: 'Post3',
      content: 'แล้ววันนี้คือวันหนึ่งหากเรามา อุตรดิตถ์ก้านสั่นไหวเกินไปสู่ฟ้าสีครามดูเธอนั้น มาร้องด้วยกันนะไม่เคยเอ่ยเปิดเผยความรัก ไปวัดบวรวัดโพธิ์เดินไม่ไกลหรอก ภาพความทรงจำแม้เธออยู่ในยามที่ฉันฝันใช่ไหม ใครที่มาได้จับมือฉันไว้ก็ได้ถึงมันทิ้งให้เราก็คงห้ามหมดไฟ ก็อาจไม่ช้าก็เหมือนอย่างเลื่อนลอย และยังไงและที่ไหนมาได้เลยสักวันฉันจะลืมได้เลย',
      author: 'User3',
    },
  ]

const PostPage = () => {
    const [posts, setPosts] = useState(initialPosts)

    const addPost = (post) => {
        // posts.push({id: posts.length + 1, ...post})
        const newPostWithID = { id: posts.length + 1, ...post}
        setPosts([...posts, newPostWithID])
    }

    return (
        // ควรใช้ Fragment แทน div จะได้ไม่ต้อง render ไม่ก็ใช้ <> </> เพื่อให้ return เป็นก้อนเดียว
        <Fragment> 
            <CreatePostForm addPost={ addPost }/>
            {/* <PostList posts={ posts } /> */}
            <FilterBox posts={posts} />
        </Fragment>
        
    )
}

export default PostPage